code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналВходящихСообщенийKafka.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналВходящихСообщенийKafka</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ключ</Name>
					<Comment>Ключ (key) сообщения Kafka</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбработкиСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешнийИсточник</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналВходящихСообщенийKafka/Ext/ManagerModule.bsl
// Добавляет сообщение в регистр
// Параметры:
//  ВнешнийИсточник - ПланВидовХарактеристик.ВнешниеИсточники - Внешний источник, по которому получено сообщение
//  Ключ - строка - Ключ сообщения JSON
//  Сообщение - строка - текст сообщения JSON
//  ВремяСообщения - строка - дата сообщения в формате "yyyyMMddHHmmss"
Процедура Добавить(ВнешнийИсточник, Ключ, Сообщение, ВремяСообщения) Экспорт
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	Попытка
		Набор = НаборСОтбором(ВнешнийИсточник, Идентификатор);
		СообщениеВНаборе = Набор.Добавить();
		СообщениеВНаборе.ВнешнийИсточник = ВнешнийИсточник;
		СообщениеВНаборе.Идентификатор = Идентификатор;
		СообщениеВНаборе.Ключ = Ключ;
		СообщениеВНаборе.ТипСообщения = Кафка.ТипСообщенияИзКлючаСообщения(Ключ);
		СообщениеВНаборе.Сообщение = Сообщение;
		СообщениеВНаборе.ПериодСообщения = Дата(ВремяСообщения);
		Набор.Записать();
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			"Чтение топика kafka " + ВнешнийИсточник,
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОписаниеОшибки);
		ПолноеСообщениеKafka = ВремяСообщения + Символы.ПС + Ключ + Символы.ПС + Сообщение;
		РегистрыСведений.ОшибкиОнлайнЗагрузкиИзВнешнихИсточников.Добавить(ВнешнийИсточник, ПолноеСообщениеKafka);
	КонецПопытки;
КонецПроцедуры

Функция НаборСОтбором(ВнешнийИсточник, Идентификатор)
	Набор = РегистрыСведений.ЖурналВходящихСообщенийKafka.СоздатьНаборЗаписей();
	Набор.Отбор.ВнешнийИсточник.Установить(ВнешнийИсточник, Истина);
	Набор.Отбор.Идентификатор.Установить(Идентификатор, Истина);
	Возврат Набор;
КонецФункции

// Устанавливает флаг ОшибкаОбработки сообщению
// Параметры:
//  ВнешнийИсточник - ПланВидовХарактеристик.ВнешниеИсточники - Внешний источник, по которому поступило сообщение
//  Идентификатор - Строка - ГУИД сообщения
//  ОписаниеОшибки - Строка - Описание возникшей ошибки
Процедура ЗаписатьОшибку(ВнешнийИсточник, Идентификатор, ОписаниеОшибки) Экспорт
	Набор = НаборСОтбором(ВнешнийИсточник, Идентификатор);
	Набор.Прочитать();
	Если Набор.Количество() > 0 Тогда
		СообщениеСОшибкой = Набор[0];
		СообщениеСОшибкой.ОшибкаОбработки = Истина;
		СообщениеСОшибкой.ОписаниеОшибки = ОписаниеОшибки;
	Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает флаг Обработан сообщению
// Параметры:
//  ВнешнийИсточник - ПланВидовХарактеристик.ВнешниеИсточники - Внешний источник, по которому поступило сообщение
//  Идентификатор - Строка - ГУИД сообщения
Процедура ЗавершитьОбработку(ВнешнийИсточник, Идентификатор) Экспорт
	Набор = НаборСОтбором(ВнешнийИсточник, Идентификатор);
	Набор.Прочитать();
	Если Набор.Количество() > 0 Тогда
		ОбработанноеСообщение = Набор[0];
		ОбработанноеСообщение.Обработан = Истина;
		ОбработанноеСообщение.ПериодОбработкиСообщения = ТекущаяДатаСеанса();
	Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры
